package it.academy.booking.tourist;

public class Task {
    //список только юзеров +
    //список только админов +
    //список только юзеров компаний +
    //список городов +
    //список стран +
    //список компаний +
    //список машин по конкретной компании +
    //список заблокированных юзеров +
    //список писем от юзеров +
    //список забронированных машин по конкретному юзеру (для юзера) +
    //сохранение города +
    //сохранение страны +
    //сохранение компании ( для юзера компании) +
    //сохранение сообщения от юзера +
    //удаление машины ( для юзера компании) +
    //удаления письма ( админ) +
    //удаления страны ( админ) +
    //удаление компании (админ) +
    //удаления компании ( юзер компании) +
    //удаления города ( админ) +
    //разблакировка пользователя +
    //блокировка пользователя +
    //возможность писать письмо если ты забанен +
    //сохранение машины +
    //поиск пользователя по логину +
    //поиск компании по названию +
    //список забранированных машин по конкретному юзеру (для админа)
    //список фотографий по конкретной машине
    //список цены по конкретной машине
    //список машин конкретной компании( для юзера компании )
    //сохранения цены для конкретной машины
    //удаления цены для конкретной машины ( юзер компании)
    //удаления фото для машины ( юзер компании)
    //вывод информации о себе ( пользователя ) карточка + пасспорт
    //бронирование автомобиля
    //отмена бронирования автомобиля
    //оплата при бронировании
    //возврат денег при отмене бронирования
}
