package it.academy.booking.tourist;

public class Task {
    //список только юзеров
    //список только админов
    //список только юзеров компаний
    //список городов
    //список стран
    //список компаний
    //список машин по конкретной компании
    //список всех удаленных юзеров
    //список удаленных только юзеров
    //список удаленных админов
    //список удаленных компаний юзеров
    //список удаленных городов
    //список удаленных стран
    //список удаленных компаний
    //список заблокированных юзеров
    //список писем от юзеров
    //список забронированных машин по конкретному юзеру
    //список фотографий по конкретной машине
    //список цены по конкретной машине
    //список машин конкретной компании( для юзера компании )
    //сохранение машины
    //сохранение города
    //сохранение страны
    //сохранение компании ( для юзера компании)
    //сохранение сообщения от юзера
    //сохранения цены для конкретной машины
    //удаление машины ( для юзера компании)
    //удаления письма ( админ)
    //удаления страны ( админ)
    //удаления компании ( юзер компании)
    //удаления города ( админ)
    //удаления цены для конкретной машины ( юзер компании)
    //удаления фото для машины ( юзер компании)
    //вывод информации о себе ( пользователя ) карточка + пасспорт
    //возможность писать письмо если ты забанен
    //разблакировка пользователя
    //блокировка пользователя
    //поиск пользователя по логину
    //поиск компании по названию
    //бронирование автомобиля
    //отмена бронирования автомобиля
    //оплата при бронировании
    //возврат денег при отмене бронирования
}
